a
a.m.
abandon
abbey
ability
able
abolish
about
above
abroad
absence
absent
absolute
absorb
abstract
abuse
academic
accent
accept
acceptable
acceptance
access
accident
accidental
accommodate
accommodation
accompany
accordance
according
accordingly
account
accountant
accounting
accurate
accuse
achieve
achievement
acid
acknowledge
acquire
acquisition
acre
across
act
action
active
activity
actor
actual
acute
adapt
add
addition
additional
address
adequate
adjust
adjustment
administer
administration
administrative
admiration
admire
admission
admit
adopt
adult
advance
advantage
adventure
advertise
advertisement
advertising
advice
advise
adviser
affair
affect
affection
afford
afraid
africa
african
after
afternoon
afterwards
again
against
age
aged
agency
agenda
agent
aggressive
ago
agree
agreement
agricultural
agriculture
ahead
aid
aids
aim
air
aircraft
airline
airport
al
alarm
album
alcohol
alcoholic
alive
all
allegation
allege
alleged
alliance
allied
allocate
allocation
allow
allowance
ally
almost
alone
along
alongside
aloud
alphabet
alphabetical
already
alright
also
alter
alternative
although
altogether
always
amaze
amazing
ambition
ambulance
amendment
america
american
among
amongst
amount
amuse
analyse
analysis
analyst
ancient
and
and/or
anger
angle
angry
animal
ankle
anniversary
announce
announcement
annoy
annual
another
answer
anticipate
anxiety
anxious
any
anybody
anyone
anything
anyway
anywhere
apart
apartment
apologize
apology
apparent
appeal
appear
appearance
appendix
apple
applicant
application
apply
appoint
appointment
appreciate
approach
appropriate
approval
approve
approximate
approximately
april
arab
architect
architecture
area
argue
argument
arm
armed
army
around
arrange
arrangement
arrest
arrival
arrive
arrow
art
article
artificial
artist
artistic
as
ashamed
asia
asian
aside
ask
asleep
aspect
assault
assembly
assert
assess
assessment
asset
assign
assignment
assist
assistance
assistant
associate
association
assume
assumption
assurance
assure
at
atom
attach
attack
attempt
attend
attendance
attention
attitude
attorney
attract
attraction
attractive
attribute
audience
audit
auditor
august
aunt
australia
australian
author
authority
automatic
autonomy
autumn
availability
available
avenue
average
avoid
await
award
aware
awareness
away
awful
awkward
baby
back
background
backwards
bacterium
bad
bad-tempered
bag
baggage
bake
balance
ball
ban
band
bandage
bank
banking
bar
bare
barely
bargain
barrier
base
basic
basis
basket
bath
bathroom
battery
battle
bay
be
beach
beak
bean
bear
beard
beat
beautiful
beauty
because
become
bed
bedroom
beef
beer
before
beg
begin
beginning
behalf
behave
behaviour
behind
being
belief
believe
bell
belong
below
belt
bench
bend
beneath
benefit
beside
besides
best
bet
better
between
beyond
bible
bid
big
bike
bill
billion
bin
bind
biological
biology
birth
birthday
biscuit
bishop
bit
bite
bitter
black
blade
blame
blank
blind
block
blond
blood
bloody
blow
blue
board
boat
body
boil
bomb
bond
bone
bonus
book
boot
border
bore
born
borough
borrow
boss
both
bother
bottle
bottom
bound
boundary
bowl
box
boy
boyfriend
brain
branch
brand
brave
breach
bread
break
breakfast
breast
breath
breathe
breed
breeding
brick
bridge
brief
bright
brilliant
bring
britain
british
broad
broadcast
broken
brother
brown
brush
bubble
budget
build
builder
building
bulk
bullet
bunch
burden
bureau
burn
bursting
bury
bus
bush
business
businessman
busy
but
butter
button
buy
buyer
by
cabinet
cable
cake
calculate
calculation
california
call
calm
camera
camp
campaign
can
canada
canal
cancel
cancer
candidate
candy
cap
capability
capable
capacity
capital
capitalism
capitalist
captain
capture
car
carbon
card
cardboard
care
career
careful
careless
carpet
carriage
carrier
carrot
carry
case
cash
cast
castle
casual
cat
catalogue
catch
category
cater
cathedral
catholic
cattle
cause
cease
ceiling
celebrate
celebration
cell
cellphone
cent
centimetre
central
centre
century
ceremony
certain
certainly
certificate
chain
chair
chairman
challenge
chamber
champagne
champion
championship
chance
chancellor
change
changing
channel
chap
chapel
chapter
character
characteristic
charge
charity
chart
charter
chase
chat
cheap
cheat
check
cheek
cheerful
cheese
chemical
chemist
chemistry
cheque
chest
chew
chicken
chief
child
childhood
chin
china
chinese
chips
chocolate
choice
choose
chop
christ
christian
christianity
christmas
church
cigarette
circle
circuit
circumstance
cite
citizen
city
civil
claim
clap
clash
class
classic
classical
classification
classroom
clause
clean
clear
clerk
clever
click
client
cliff
climate
climb
clinic
clinical
clock
close
closer
closet
closure
cloth
clothes
clothing
cloud
club
clue
co-operation
coach
coal
coalition
coast
coat
code
coffee
coin
cold
collapse
colleague
collect
collection
collective
collector
college
colonel
colony
colour
coloured
column
combination
combine
come
comedy
comfort
comfortable
command
commander
comment
commercial
commission
commissioner
commit
commitment
committee
common
communicate
communication
communist
community
companion
company
comparable
compare
comparison
compensation
compete
competition
competitive
competitor
complain
complaint
complete
completion
complex
complexity
complicated
comply
component
compose
composition
compound
comprehensive
comprise
compromise
computer
computing
concede
conceive
concentrate
concentration
concept
conception
concern
concerning
concert
concession
conclude
conclusion
concrete
condemn
condition
conduct
conference
confidence
confident
confine
confirm
conflict
confront
confuse
confused
confusion
congratulation
congress
connect
connection
conscious
consciousness
consensus
consent
consequence
consequently
conservation
conservative
consider
considerable
consideration
consist
consistent
constable
constant
constituency
constitute
constitution
constitutional
constraint
construct
construction
consult
consultant
consultation
consume
consumer
consumption
contact
contain
container
contemporary
content
contest
context
continent
continue
continuing
continuous
contract
contrast
contribute
contribution
control
controversial
controversy
convenient
convention
conventional
conversation
conversion
convert
convey
conviction
convince
cook
cooker
cookie
cool
cope
copper
copy
core
corner
corporate
corporation
correct
correlation
correspond
correspondent
corridor
cost
cottage
cotton
cough
could
council
councillor
count
counter
country
countryside
county
coup
couple
courage
course
court
cousin
cover
coverage
cow
craft
crash
crazy
cream
create
creation
creative
creature
credit
creditor
crew
cricket
crime
criminal
crisis
crisp
criterion
critic
critical
criticise
criticism
crop
cross
crowd
crown
crucial
cruel
crush
cry
crystal
cultural
culture
cup
cupboard
curb
cure
curious
curl
curly
currency
current
curriculum
curtain
curve
custom
customer
customs
cut
cycle
dad
daddy
daily
damage
damp
dance
dancer
danger
dangerous
dare
dark
darkness
darling
data
database
date
daughter
day
dead
deaf
deal
dealer
dear
death
debate
debt
decade
decay
december
decent
decide
decision
declaration
declare
decline
decorate
decoration
decorative
decrease
deep
defeat
defence
defend
defendant
defender
deficit
define
definitely
definition
degree
delay
delegate
delegation
deliberately
delicate
delight
delighted
deliver
delivery
demand
democracy
democrat
democratic
demonstrate
demonstration
density
dentist
deny
department
departure
depend
dependent
depending
deposit
depress
depression
depth
deputy
derive
describe
description
desert
deserve
design
designer
desirable
desire
desk
desperate
despite
destroy
destruction
detail
detailed
detect
detective
determination
determine
develop
developer
developing
development
device
devil
devise
devote
diagnosis
diagram
dialogue
diamond
diary
dictionary
die
diet
differ
difference
different
difficult
difficulty
dig
digital
dimension
dinner
diplomatic
direct
direction
directive
director
directory
dirt
dirty
disability
disabled
disadvantage
disagree
disagreement
disappear
disappoint
disappointed
disappointment
disapproval
disapprove
disaster
disc
discipline
disclose
discount
discourse
discover
discovery
discretion
discrimination
discuss
discussion
disease
disgust
dish
dishonest
dislike
dismiss
disorder
display
disposal
dispute
dissolve
distance
distant
distinct
distinction
distinctive
distinguish
distribute
distribution
district
disturb
divide
dividend
division
divorce
dna
do
dock
doctor
doctrine
document
dog
dollar
domain
domestic
dominant
dominate
door
doorway
dose
dot
double
doubt
down
downstairs
dozen
draft
drag
drama
dramatic
draw
drawer
drawing
dream
dress
drift
drink
drive
driver
drop
drug
drugstore
drum
drunk
dry
duck
due
duke
dull
dump
duration
during
dust
dutch
duty
dvd
each
eagle
ear
earl
earlier
early
earn
earnings
earth
ease
east
easter
eastern
easy
eat
echo
economic
economics
economy
edge
edition
editor
educate
education
educational
effect
effective
effectiveness
efficiency
efficient
effort
egg
egypt
eight
eighteen
eighteenth
eighty
either
elbow
elderly
elect
election
electoral
electric
electrical
electricity
electronic
elegant
element
elevator
eleven
eliminate
else
elsewhere
email
embarrass
embarrassment
emerge
emergency
emission
emotion
emotional
emperor
emphasis
emphasise
empire
employ
employee
employer
employment
empty
enable
encounter
encourage
encouragement
encouraging
end
enemy
energy
enforce
engage
engine
engineer
engineering
england
english
enhance
enjoy
enjoyable
enjoyment
enormous
enough
enquiry
ensure
enter
enterprise
entertain
entertainer
entertainment
enthusiasm
enthusiastic
entire
entitle
entrance
entry
envelope
environment
environmental
envisage
episode
equal
equation
equip
equipment
equity
equivalent
era
error
escape
especially
essay
essence
essential
establish
established
establishment
estate
estimate
et
etc
ethnic
euro
europe
european
evaluate
evaluation
even
evening
event
eventually
ever
every
everybody
everyday
everyone
everything
everywhere
evidence
evident
evil
evolution
evolve
exact
exaggerate
examination
examine
example
exceed
excellent
except
exception
exchange
excite
excitement
exciting
exclude
exclusive
excuse
execute
executive
exercise
exhibit
exhibition
exist
existence
existing
exit
expand
expansion
expect
expectation
expenditure
expense
expensive
experience
experiment
experimental
expert
expertise
explain
explanation
explicit
explode
exploit
explore
explosion
export
expose
exposure
express
expression
extend
extension
extensive
extent
external
extra
extract
extraordinary
extreme
eye
fabric
face
facility
fact
factor
factory
fade
fail
failure
faint
fair
faith
faithful
fall
false
fame
familiar
family
famous
fan
fancy
fantasy
far
farm
farmer
farming
fashion
fashionable
fast
fasten
fat
fate
father
faucet
fault
favour
favourite
fear
feather
feature
february
federal
federation
fee
feed
feel
feeling
fellow
female
fence
festival
fetch
fever
few
fewer
fibre
fiction
field
fifteen
fifth
fifty
fight
fighting
figure
file
fill
film
filter
final
finance
financial
find
finding
fine
finger
finish
fire
firm
first
fish
fishing
fit
five
fix
flag
flame
flash
flat
flavour
flee
fleet
flesh
flexibility
flexible
flight
float
flood
floor
flour
flow
flower
flu
fluid
fly
flying
focus
fold
folk
follow
following
food
fool
foot
football
for
force
forecast
foreign
forest
forever
forget
forgive
fork
form
formal
format
formation
former
formula
fortune
forty
forum
forward
found
foundation
four
fourteen
fourth
fraction
fragment
frame
framework
france
fraud
free
freedom
freeze
french
frequency
frequent
fresh
friday
fridge
friend
friendly
friendship
frightened
from
front
frown
fruit
fry
fuel
fulfil
full
full-time
fun
function
functional
fund
fundamental
funding
funeral
funny
fur
furniture
further
furthermore
future
gain
gallery
gamble
game
gang
gap
garage
garbage
garden
gas
gastric
gate
gather
gaze
gear
gender
gene
general
generate
generation
generous
genetic
gentle
gentleman
gently
genuine
geography
german
germany
gesture
get
ghost
giant
gift
girl
girlfriend
give
given
glad
glance
glass
global
glory
glove
glue
go
goal
god
gold
golden
golf
good
goodbye
goods
govern
government
governor
grab
grade
gradually
graduate
grain
gram
grammar
grand
grandchild
granddaughter
grandfather
grandmother
grandparent
grandson
grant
graphics
grass
grateful
grave
great
greek
green
greet
grey
grin
grip
grocery
gross
ground
group
grow
growing
growth
guarantee
guard
guess
guest
guidance
guide
guideline
guilt
guilty
guitar
gun
guy
habit
hair
hairdresser
half
hall
hammer
hand
handle
hang
happen
happiness
happy
harbour
hard
hardly
hardware
harm
harmful
harmless
hat
hate
hatred
have
he
head
headache
heading
headquarters
heal
health
healthy
hear
hearing
heart
heat
heating
heaven
heavy
heel
height
hell
hello
help
helpful
hence
her
here
heritage
hero
hers
herself
hesitate
hey
hide
hierarchy
high
highlight
highway
hill
him
himself
hint
hip
hire
his
historian
historic
historical
history
hit
hobby
hold
holder
holding
hole
holiday
hollow
holy
home
homework
honest
honour
hope
hopefully
horizon
horizontal
horn
horror
horse
hospital
host
hot
hotel
hour
house
household
housing
how
however
huge
human
humorous
humour
hundred
hungry
hunt
hunting
hurry
hurt
husband
hypothesis
i
i.e.
ice
idea
ideal
identical
identification
identify
identity
ideology
if
ignore
ill
illegal
illness
illustrate
illustration
image
imaginary
imagination
imagine
immediate
immoral
impact
impatient
imperial
implement
implementation
implication
imply
import
importance
important
impose
impossible
impress
impression
impressive
improve
improvement
in
inability
inadequate
incentive
inch
incidence
incident
include
including
income
increase
increasing
indeed
independence
independent
index
india
indian
indicate
indication
indicator
indirect
individual
indoors
industrial
industry
inevitable
infant
infect
infection
infectious
inflation
influence
influential
inform
informal
information
ingredient
inherit
initial
initiate
initiative
injure
injury
ink
inn
inner
innocent
input
insect
insert
inside
insight
insist
inspection
inspector
install
installation
instance
instead
instinct
institute
institution
institutional
instruct
instruction
instrument
insult
insurance
integrate
integration
intellectual
intelligence
intelligent
intend
intense
intensive
intention
interaction
interest
interested
interesting
interface
interfere
interior
internal
international
internet
interpret
interpretation
interrupt
interval
intervention
interview
into
introduce
introduction
invasion
invent
invention
invest
investigate
investigation
investment
investor
invitation
invite
involved
involvement
iran
iraq
ireland
irish
iron
is
is/are
island
isle
isolate
isolation
israel
issue
it
italian
italy
item
its
itself
jacket
jam
january
japan
japanese
jealous
jeans
jelly
jesus
jet
jew
jewellery
jewish
job
join
joint
joke
journal
journalist
journey
joy
judge
judgement
judicial
juice
july
jump
junction
june
junior
jurisdiction
jury
just
justice
justification
justify
keen
keep
key
keyword
kick
kid
kill
killer
kilogram
kilometre
kind
kindness
king
kiss
kit
kitchen
knee
knife
knit
knock
knot
know
knowledge
known
korea
label
laboratory
labour
lack
lad
lady
lake
lamp
land
landing
landlord
landscape
lane
language
large
last
late
later
latin
latter
laugh
laughter
launch
law
lawyer
lay
layer
lazy
lead
leader
leadership
leading
leaf
leaflet
league
lean
leap
learn
learning
lease
least
leather
leave
lecture
left
leg
legal
legislation
legislative
leisure
lemon
lend
length
less
lesser
lesson
let
letter
level
liability
liable
liberation
liberty
library
licence
license
lid
lie
life
lifespan
lifetime
lift
light
like
likely
limit
limitation
line
linguistic
link
lion
lip
liquid
list
listen
literally
literary
literature
litre
little
live
lively
living
load
loan
local
locate
location
lock
logic
logical
lonely
long
long-term
longer
look
loose
lord
lorry
lose
loss
lost
lot
lots
loud
love
lovely
lover
low
lower
loyal
loyalty
luck
lucky
luggage
lump
lunch
lung
machine
machinery
mad
magazine
magic
magistrate
magnificent
mail
main
maintain
maintenance
major
majority
make
make-up
maker
male
mall
man
manage
management
manager
managing
manner
manufacturer
manufacturing
many
map
march
margin
marginal
marine
mark
market
marketing
marriage
marry
marvellous
mass
massive
master's
match
mate
material
mathematics
matter
maximum
may
maybe
mayor
me
meal
mean
meaning
means
meanwhile
measure
measurement
meat
mechanical
mechanism
media
medical
medicine
medieval
medium
meet
meeting
melt
member
membership
memory
mental
mention
menu
merchant
mere
merger
merit
mess
message
metal
method
metre
midday
middle
midnight
might
mild
mile
military
milk
mill
milligram
millimetre
million
mind
mine
miner
mineral
minimum
minister
ministry
minor
minority
minute
mirror
miss
missile
mission
mistake
mix
mixed
mixture
mobile
mode
model
modern
modest
modification
modify
molecule
moment
monday
monetary
money
monitor
monopoly
month
monthly
mood
moon
moral
more
moreover
morning
mortality
mortgage
most
mostly
mother
motion
motivation
motive
motor
motorcycle
mount
mountain
mouse
mouth
move
movement
movie
much
mud
multiple
multiply
mum
mummy
murder
murmur
muscle
museum
music
musical
musician
must
mutter
mutual
my
myself
mysterious
mystery
myth
nail
naked
name
namely
narrow
nasty
nation
national
native
natural
nature
navy
near
nearby
nearly
neat
necessary
necessity
neck
need
needle
negative
negotiate
negotiation
neighbour
neighbourhood
neither
nephew
nerve
nervous
nest
net
network
never
nevertheless
new
news
newspaper
next
nhs
nice
niece
night
nightmare
nine
nineteen
nineteenth
ninety
no
nobody
nod
noise
noisy
none
nonsense
nor
norm
normal
north
northern
nose
not
notably
note
nothing
notice
noticeable
notion
novel
november
now
nowhere
nuclear
number
numerous
nurse
nursery
nut
o'clock
oak
obey
object
objection
objective
obligation
observation
observe
observer
obtain
obvious
occasion
occasional
occupation
occupy
occur
ocean
october
odd
of
off
offence
offend
offender
offensive
offer
office
officer
official
often
oil
okay
old
old-fashioned
on
once
one
onion
only
onto
open
opening
opera
operate
operating
operation
operator
opinion
opponent
opportunity
oppose
opposite
opposition
opt
option
or
oral
orange
order
ordinary
organ
organic
organisation
organism
organize
origin
original
other
otherwise
ought
our
ours
ourselves
out
outcome
outdoors
outer
outline
output
outside
outstanding
oven
over
overall
overcome
overlook
overseas
owe
own
owner
ownership
oxygen
p.m.
pace
pack
package
page
pain
painful
paint
painter
painting
pair
pakistan
palace
pale
palm
pan
panel
panic
pants
paper
paragraph
parallel
parent
parish
park
parliament
parliamentary
part
part-time
partial
participant
participate
participation
particle
particular
partly
partner
partnership
party
pass
passage
passenger
passion
passport
past
patch
path
patient
pattern
pause
pavement
pay
payment
pc
peace
peaceful
peak
peasant
peer
pen
penalty
penny
pension
pensioner
people
pepper
per
perceive
percentage
perception
perfect
perform
performance
performer
perhaps
period
permanent
permission
permit
persist
person
personal
personality
personnel
perspective
persuade
pet
petrol
phase
phenomenon
philosophy
phone
photo
photocopy
photograph
photographer
photography
phrase
physical
physics
piano
pick
picture
piece
pig
pile
pill
pilot
pink
pint
pipe
pit
pitch
pity
place
plain
plaintiff
plan
plane
planet
planning
plant
plastic
plate
platform
play
player
plead
pleasant
please
pleased
pleasure
plenty
plot
plug
plus
pm
pocket
poem
poet
poetry
point
poison
poisonous
poland
pole
police
policeman
policy
polish
polite
political
politician
politics
poll
pollution
polytechnic
pond
pool
poor
pop
pope
popular
population
port
portfolio
portrait
pose
position
positive
possess
possession
possibility
possible
post
pot
potato
potential
pound
pour
poverty
powder
power
powerful
practical
practice
practise
practitioner
praise
pray
prayer
precise
predict
prefer
preference
pregnancy
pregnant
preliminary
premise
premium
preparation
prepare
presence
present
presentation
preserve
president
presidential
press
pressure
presumably
pretend
pretty
previous
price
pride
priest
primary
prime
prince
princess
principal
principle
print
printer
prior
priority
prison
prisoner
private
privilege
prize
probability
probable
problem
procedure
proceed
proceeding
process
processing
processor
produce
producer
product
production
productivity
profession
professional
professor
profile
profit
programme
progress
project
prominent
promise
promote
promotion
prompt
pronounce
pronunciation
proof
proper
property
proportion
proposal
propose
proposition
prosecution
prospect
protect
protection
protein
protest
proud
prove
provide
provided
province
provision
provoke
psychological
psychology
pub
public
publication
publicity
publish
publisher
publishing
pull
punch
punish
punishment
pupil
purchase
purchaser
pure
purple
purpose
pursue
push
put
qualification
qualify
quality
quantity
quarter
queen
question
quick
quiet
quit
quite
quote
rabbit
race
radiation
radical
radio
raid
rail
railway
rain
raise
random
range
rank
rape
rapid
rare
rat
rate
rather
ratio
rational
raw
reach
react
reaction
read
reader
reading
ready
real
realistic
reality
realize
really
rear
reason
reasonable
rebel
recall
receipt
receive
receiver
recent
recently
reception
recession
recipe
reckon
recognise
recognition
recommend
recommendation
record
recording
recover
recovery
recruit
red
reduce
reduction
redundancy
ref
refer
reference
reflect
reflection
reform
refrigerator
refugee
refusal
refuse
regard
regarding
regime
region
regional
register
registration
regret
regular
regulate
regulation
reign
reinforce
reject
related
relation
relationship
relative
relax
release
relevant
reliable
relief
religion
religious
reluctant
rely
remain
remaining
remark
remarkable
remedy
remember
remind
remote
removal
remove
render
renovation
rent
repair
repeat
replace
replacement
reply
report
reporter
represent
representation
representative
reproduce
republic
reputation
request
require
requirement
rescue
research
researcher
resemble
reservation
reserve
residence
resident
residential
resign
resignation
resist
resistance
resolution
resolve
resort
resource
respect
respectively
respire
respond
response
responsibility
responsible
rest
restaurant
restoration
restore
restrict
restriction
result
resume
retail
retain
retire
retirement
return
reveal
revenue
reverse
review
revise
revision
revolution
revolutionary
reward
rhythm
rice
rich
rid
ride
rider
ridiculous
right
ring
riot
rise
risk
rival
river
road
rob
rock
rod
role
roll
roman
romantic
roof
room
root
rope
rose
rough
roughly
round
route
routine
row
royal
rub
rubber
rubbish
rude
rugby
ruin
rule
ruler
ruling
rumour
run
runner
running
rural
rush
russia
russian
sack
sad
sadness
safe
safety
sail
sailor
sake
salad
salary
sale
salt
salty
same
sample
sand
sandwich
satellite
satisfaction
satisfactory
satisfy
saturday
sauce
save
saving
say
sb
scale
scales
scandal
scare
scene
schedule
scheme
scholar
school
science
scientific
scientist
scissors
scope
score
scotland
scottish
scratch
scream
screen
screw
sculpture
sea
seal
search
season
seat
second
secondary
secondly
secret
secretary
section
sector
secure
security
see
seed
seek
seem
seize
select
selection
self
sell
seller
senate
senator
send
senior
sensation
sense
sensible
sensitive
sentence
separate
separation
september
sequence
sergeant
series
serious
servant
serve
server
service
session
set
setting
settle
settlement
seven
seventeen
seventy
several
severe
sew
sex
sexual
shade
shadow
shake
shall
shallow
shame
shape
share
shareholder
sharp
shave
she
sheep
sheer
sheet
shelf
shell
shelter
shift
shine
shiny
ship
shirt
shock
shoe
shoot
shop
shopping
shore
short
shortage
shot
should
shoulder
shout
show
shower
shrug
shut
shy
sick
side
sideways
sigh
sight
sign
signal
signature
significance
significant
silence
silent
silk
silly
silver
similar
simple
simultaneously
sin
since
sincere
sincerely
single
sink
sir
sister
sit
site
situate
situation
six
sixteen
sixth
sixty
size
skilful
skill
skilled
skin
skirt
sky
sleep
sleeve
slice
slide
slight
slip
slope
slow
small
smart
smash
smell
smile
smoke
smooth
snake
snap
snow
so
so-called
soap
social
socialist
society
sociology
sock
soft
software
soil
soldier
sole
solicitor
solid
solution
solve
some
somebody
somehow
someone
something
sometimes
somewhat
somewhere
son
song
soon
sooner
sophisticated
sore
sorry
sort
soul
sound
soup
sour
source
south
southern
soviet
space
spain
spanish
spare
speak
speaker
special
specialist
species
specific
specification
specify
specimen
spectacular
spectrum
speculation
speech
speed
spell
spend
spending
sphere
spice
spicy
spider
spin
spirit
spiritual
spite
split
spoil
spokesman
spoon
sport
spot
spray
spread
spring
squad
square
squeeze
stability
stable
staff
stag
stage
stager
stairs
stake
stamp
stance
stand
standard
standing
star
stare
start
state
statement
station
statistical
statistics
statue
status
statute
statutory
stay
steady
steal
steam
steel
steep
steer
step
sth
stick
sticky
stiff
still
stimulate
stimulus
sting
stir
stock
stomach
stone
stop
storage
store
storm
story
stove
straight
straightforward
strain
strange
stranger
strategic
strategy
stream
street
strength
strengthen
stress
stretch
strict
strike
string
strip
stripe
stroke
strong
structural
structure
struggle
student
studio
study
stuff
stupid
style
subject
submit
subsequent
subsidiary
subsidy
substance
substantial
substitute
subtle
succeed
success
successful
succession
successive
successor
such
suck
sudden
suffer
sufficient
sugar
suggest
suggestion
suicide
suit
suitable
suitcase
sum
summary
summer
summit
sun
sunday
superb
superior
supermarket
supplier
supply
support
supporter
suppose
supreme
sure
surface
surgery
surname
surprise
surprised
surprising
surround
survey
survival
survive
suspect
suspend
suspicion
suspicious
sustain
swallow
swear
sweat
sweater
sweep
sweet
swell
swim
swimming
swing
switch
sword
symbol
sympathetic
sympathy
symptom
system
table
tablet
tackle
tactic
tail
take
tale
talent
talk
tall
tank
tap
tape
target
task
taste
tax
taxation
taxi
tea
teach
teacher
teaching
team
tear
technical
technique
technology
teenager
telephone
television
tell
temperature
temple
temporary
ten
tenant
tend
tendency
tennis
tension
tent
term
terms
terrace
terrible
territory
test
testing
text
than
thank
thanks
that
the
theatre
theft
their
theirs
them
theme
themselves
then
theoretical
theory
therapy
there
thereby
therefore
these
they
thick
thickness
thief
thin
thing
think
thinking
third
thirsty
thirteen
thirty
this
thorough
thoroughly
those
though
thought
thousand
thread
threat
threaten
three
throat
through
throughout
throw
thumb
thursday
thus
ticket
tide
tidy
tie
tight
till
timber
time
timetable
timing
tin
tiny
tip
tired
tissue
title
to
today
toe
together
toilet
tomato
tomorrow
tone
tongue
tonight
tonne
too
tool
tooth
top
topic
total
touch
tough
tour
tourist
tournament
towards
towel
tower
town
toy
trace
track
trade
trader
trading
tradition
traditional
traffic
tragedy
train
trainer
training
transaction
transfer
transform
transformation
transition
translate
translation
transparent
transport
trap
travel
traveller
tray
treasury
treat
treatment
treaty
tree
tremendous
trend
trial
triangle
tribunal
trick
trip
triumph
troop
tropical
trouble
trousers
truck
true
trust
trustee
truth
try
tube
tuesday
tune
tunnel
turn
turnover
tv
twelve
twentieth
twenty
twice
twin
twist
two
type
typical
typically
tyre
ugly
uk
ultimate
umbrella
unable
unacceptable
uncertain
uncertainty
uncle
uncomfortable
unconscious
uncontrolled
under
undergo
underground
underlying
undermine
underneath
understand
understanding
undertake
underwater
underwear
undo
undoubtedly
unemployed
unemployment
unexpected
unfair
unfortunate
unfortunately
unfriendly
unhappiness
unhappy
uniform
unimportant
union
unique
unit
unite
united
unity
universal
universe
university
unkind
unknown
unless
unlike
unlikely
unload
unlucky
unnecessary
unpleasant
unreasonable
unsteady
unsuccessful
untidy
until
unusual
unwilling
up
upon
upper
upset
upside
upstairs
upwards
urban
urge
urgent
us
usa
use
used
useful
useless
user
usual
vacation
valid
valley
valuable
value
van
variable
variation
variety
various
vary
vast
vegetable
vehicle
vendor
venture
verse
version
vertical
very
vessel
via
victim
victorian
victory
video
videotape
vietnam
view
villa
village
violence
violent
virtually
virtue
virus
visible
vision
visit
visitor
visual
vital
vocabulary
voice
volume
voluntary
volunteer
vote
voter
vulnerable
wage
waist
wait
waiter
wake
wales
walk
wall
wallet
wander
want
war
ward
warm
warmth
warn
warning
wash
waste
watch
water
wave
way
we
weak
weakness
wealth
weapon
wear
weather
web
website
wedding
wednesday
week
weekend
weekly
weigh
weight
welcome
welfare
well
welsh
west
western
wet
what
whatever
wheel
when
whenever
where
whereas
whereby
wherever
whether
which
while
whilst
whisky
whisper
whistle
white
who
whoever
whole
whom
whose
why
wide
widespread
widow
width
wife
wild
wildlife
will
willing
willingness
win
wind
window
wine
wing
winner
winter
wipe
wire
wise
wish
with
withdraw
withdrawal
within
without
witness
woman
wonder
wonderful
wood
wooden
wool
word
work
worker
working
working-class
works
workshop
world
worry
worse
worship
worst
worth
would
wound
wrap
wrist
write
writer
writing
written
wrong
yard
yawn
year
yellow
yes
yesterday
yet
yield
you
young
youngster
your
yours
yourself
youth
zero
zone